STMicroelectronics/STM32CubeWB/Middlewares/ST/STM32_WPAN/zigbee/core/src/zigbee_core_wb.c
/* Only required by zbcli. And only helps with automated verification of test cases.
 * Do not use for certification. */
void
ZbNwkAddrSetNextChildAddr(struct ZigBeeT *zb, uint16_t nextChildAddr)
{
    Zigbee_Cmd_Request_t *ipcc_req;

    Pre_ZigbeeCmdProcessing();
    ipcc_req = ZIGBEE_Get_OTCmdPayloadBuffer();
    ipcc_req->ID = MSG_M4TOM0_NWK_SET_NEXT_CHILD_ADDR;
    ipcc_req->Size = 1;
    ipcc_req->Data[0] = (uint32_t)nextChildAddr;
    ZIGBEE_CmdTransfer();
} /* ZbNwkAddrSetNextChildAddr */

/* Required for zigbee certification only. May not be required for a DUT though. */
bool
nwk_status_send(struct ZigBeeT *zb, uint16_t dstAddr, enum ZbNwkAddrModeT dstAddrMode,
    uint16_t statusAddr, enum ZbNwkNetworkStatusCodeT statusCode)
{
    /* TODO? */
    return false;
} /* nwk_status_send */

/* Required for zigbee certification only. May not be required for a DUT though. */
bool
nwk_rreq_by_route_is_active(struct ZigBeeT *zb, ZbNwkRouteEntryT *route)
{
    /* TODO? */
    return false;
} /* nwk_rreq_by_route_is_active */

bool
ZbNwkSendEdkaReq(struct ZigBeeT *zb)
{
    /* TODO - may be required for a true sleepy device, where application wants
     * full control of when device polls for data. */
    return false;
}

/******************************************************************************
 * ZDO Utility
 ******************************************************************************
 */
struct zdo_device_annce_cb_info {
    struct ZbZdoDeviceAnnceFilterT *handle;
    void (*callback)(struct ZigBeeT *zb, ZbZdoDeviceAnnceT *annce, uint8_t seqno);
};

#define ZB_IPC_ZDO_DEVICE_ANNCE_CB_LIST_MAX         4
static struct zdo_device_annce_cb_info zdo_device_annce_cb_list[ZB_IPC_ZDO_DEVICE_ANNCE_CB_LIST_MAX];

struct ZbZdoDeviceAnnceFilterT *
ZbZdoDeviceAnnceFilterRegister(struct ZigBeeT *zb,
    void (*callback)(struct ZigBeeT *zb, ZbZdoDeviceAnnceT *annce, uint8_t seqno))
{
    Zigbee_Cmd_Request_t *ipcc_req;
    struct ZbZdoDeviceAnnceFilterT *handle;
    struct zdo_device_annce_cb_info *cb_info;
    unsigned int i;

    if (callback == NULL) {
        return NULL;
    }
    for (i = 0; i < ZB_IPC_ZDO_DEVICE_ANNCE_CB_LIST_MAX; i++) {
        cb_info = &zdo_device_annce_cb_list[i];
        if (cb_info->handle == NULL) {
            break;
        }
    }
    if (i == ZB_IPC_ZDO_DEVICE_ANNCE_CB_LIST_MAX) {
        return NULL;
    }

    Pre_ZigbeeCmdProcessing();
    ipcc_req = ZIGBEE_Get_OTCmdPayloadBuffer();
    ipcc_req->ID = MSG_M4TOM0_ZDO_DEVICE_ANNCE_FILTER_REG;
    ipcc_req->Size = 0;
    ZIGBEE_CmdTransfer();
    handle = (struct ZbZdoDeviceAnnceFilterT *)zb_ipc_m4_get_retval();
    if (handle != NULL) {
        cb_info->handle = handle;
        cb_info->callback = callback;
    }
    return handle;
    /* Followed up in MSG_M0TOM4_ZDO_DEVICE_ANNCE_FILTER_CB handler */
} /* ZbZdoDeviceAnnceFilterRegister */

void
ZbZdoDeviceAnnceFilterRemove(struct ZigBeeT *zb, struct ZbZdoDeviceAnnceFilterT *handle)
{
    Zigbee_Cmd_Request_t *ipcc_req;
    struct zdo_device_annce_cb_info *cb_info;
    unsigned int i;

    if (handle == NULL) {
        return;
    }
    for (i = 0; i < ZB_IPC_ZDO_DEVICE_ANNCE_CB_LIST_MAX; i++) {
        cb_info = &zdo_device_annce_cb_list[i];
        if (cb_info->handle == handle) {
            break;
        }
    }
    if (i == ZB_IPC_ZDO_DEVICE_ANNCE_CB_LIST_MAX) {
        return;
    }

    Pre_ZigbeeCmdProcessing();
    ipcc_req = ZIGBEE_Get_OTCmdPayloadBuffer();
    ipcc_req->ID = MSG_M4TOM0_ZDO_DEVICE_ANNCE_FILTER_DEL;
    ipcc_req->Size = 1;
    ipcc_req->Data[0] = (uint32_t)handle;
    ZIGBEE_CmdTransfer();
    cb_info->handle = NULL;
} /* ZbZdoDeviceAnnceFilterRemove */

/******************************************************************************
 * ZDO
 ******************************************************************************
 */
enum ZbStatusCodeT
ZbZdoNwkAddrReq(struct ZigBeeT *zb, ZbZdoNwkAddrReqT *req,
    void (*callback)(ZbZdoNwkAddrRspT *rsp, void *cb_arg), void *arg)
{
    Zigbee_Cmd_Request_t *ipcc_req;
    struct zb_ipc_m4_cb_info *info;

    info = zb_ipc_m4_cb_info_alloc((void *)callback, arg);
    if (info == NULL) {
        return ZB_STATUS_ALLOC_FAIL;
    }
    Pre_ZigbeeCmdProcessing();
    ipcc_req = ZIGBEE_Get_OTCmdPayloadBuffer();
    ipcc_req->ID = MSG_M4TOM0_ZDO_NWK_ADDR;
    ipcc_req->Size = 2;
    ipcc_req->Data[0] = (uint32_t)req;
    ipcc_req->Data[1] = (uint32_t)info;
    ZIGBEE_CmdTransfer();
    return (enum ZbStatusCodeT)zb_ipc_m4_get_retval();
    /* Followed up in MSG_M0TOM4_ZDO_NWK_ADDR_CB handler */
} /* ZbZdoNwkAddrReq */

enum ZbStatusCodeT
ZbZdoIeeeAddrReq(struct ZigBeeT *zb, ZbZdoIeeeAddrReqT *req,
    void (*callback)(ZbZdoIeeeAddrRspT *rsp, void *cb_arg), void *arg)
{
    Zigbee_Cmd_Request_t *ipcc_req;
    struct zb_ipc_m4_cb_info *info;

    info = zb_ipc_m4_cb_info_alloc((void *)callback, arg);
    if (info == NULL) {
        return ZB_STATUS_ALLOC_FAIL;
    }
    Pre_ZigbeeCmdProcessing();
    ipcc_req = ZIGBEE_Get_OTCmdPayloadBuffer();
    ipcc_req->ID = MSG_M4TOM0_ZDO_IEEE_ADDR;
    ipcc_req->Size = 2;
    ipcc_req->Data[0] = (uint32_t)req;
    ipcc_req->Data[1] = (uint32_t)info;
    ZIGBEE_CmdTransfer();
    return (enum ZbStatusCodeT)zb_ipc_m4_get_retval();
    /* Followed up in MSG_M0TOM4_ZDO_IEEE_ADDR_CB handler */
} /* ZbZdoIeeeAddrReq */

enum ZbStatusCodeT
ZbZdoNodeDescReq(struct ZigBeeT *zb, ZbZdoNodeDescReqT *req,
    void (*callback)(ZbZdoNodeDescRspT *rsp, void *cb_arg), void *arg)
{
    Zigbee_Cmd_Request_t *ipcc_req;
    struct zb_ipc_m4_cb_info *info;

    info = zb_ipc_m4_cb_info_alloc((void *)callback, arg);
    if (info == NULL) {
        return ZB_STATUS_ALLOC_FAIL;
    }
    Pre_ZigbeeCmdProcessing();
    ipcc_req = ZIGBEE_Get_OTCmdPayloadBuffer();
    ipcc_req->ID = MSG_M4TOM0_ZDO_NODE_DESC;
    ipcc_req->Size = 2;
    ipcc_req->Data[0] = (uint32_t)req;
    ipcc_req->Data[1] = (uint32_t)info;
    ZIGBEE_CmdTransfer();
    return (enum ZbStatusCodeT)zb_ipc_m4_get_retval();
    /* Followed up in MSG_M0TOM4_ZDO_NODE_DESC_CB handler */
} /* ZbZdoNodeDescReq */

