STMicroelectronics/STM32CubeWB/Middlewares/ST/STM32_WPAN/zigbee/core/src/zigbee_core_wb.c
        case MSG_M0TOM4_ZDO_DEVICE_ANNCE_FILTER_CB:
        {
            struct zdo_device_annce_cb_info *cb_info;
            unsigned int i;

            assert(p_notification->Size == 2);
            for (i = 0; i < ZB_IPC_ZDO_DEVICE_ANNCE_CB_LIST_MAX; i++) {
                cb_info = &zdo_device_annce_cb_list[i];
                if (cb_info->handle != NULL) {
                    cb_info->callback(zb_ipc_globals.zb, (ZbZdoDeviceAnnceT *)p_notification->Data[0], (uint8_t)p_notification->Data[1]);
                    break;
                }
            }
            break;
        }

        case MSG_M0TOM4_ZDO_NWK_ADDR_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoNwkAddrRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoNwkAddrRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoNwkAddrRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_IEEE_ADDR_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoIeeeAddrRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoIeeeAddrRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoIeeeAddrRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_NODE_DESC_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoNodeDescRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoNodeDescRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoNodeDescRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_POWER_DESC_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoPowerDescRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoPowerDescRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoPowerDescRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_SIMPLE_DESC_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoSimpleDescRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoSimpleDescRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoSimpleDescRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_ACTIVE_EP_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoActiveEpRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoActiveEpRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoActiveEpRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_MATCH_DESC_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoMatchDescRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoMatchDescRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoMatchDescRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_MATCH_DESC_MULTI_CB:
            if (zdo_match_multi_cb != NULL) {
                assert(p_notification->Size == 2);
                zdo_match_multi_cb((ZbZdoMatchDescRspT *)p_notification->Data[0], (void *)p_notification->Data[1]);
                /* Don't release zdo_match_multi_cb */
            }
            break;

        case MSG_M0TOM4_ZDO_BIND_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoBindRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoBindRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoBindRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_UNBIND_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoBindRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoBindRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoBindRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_MGMT_LQI_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoLqiRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoLqiRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoLqiRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_MGMT_BIND_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoMgmtBindRspT *rsp, void *cbarg);

