STMicroelectronics/STM32CubeWB/Middlewares/ST/STM32_WPAN/zigbee/core/src/zigbee_core_wb.c
                callback = (void (*)(ZbZdoMgmtBindRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoMgmtBindRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_MGMT_LEAVE_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoLeaveRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoLeaveRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoLeaveRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_MGMT_PERMIT_JOIN_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoPermitJoinRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoPermitJoinRspT *rsp, void *cbarg))info->callback;
                callback((ZbZdoPermitJoinRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZDO_MGMT_NWK_UPDATE_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZdoNwkUpdateNotifyT *rsp, void *cbarg);

                callback = (void (*)(ZbZdoNwkUpdateNotifyT *rsp, void *cbarg))info->callback;
                callback((ZbZdoNwkUpdateNotifyT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZCL_CLUSTER_DATA_IND:
        {
            ZbApsdeDataIndT *dataIndPtr;
            void *cb_arg;
            int err;

            assert(p_notification->Size == 2);
            dataIndPtr = (ZbApsdeDataIndT *)p_notification->Data[0];
            cb_arg = (void *)p_notification->Data[1];
            err = zcl_cluster_data_ind(dataIndPtr, cb_arg);
            /* Return err in second argument */
            p_notification->Data[1] = (uint32_t)err;
            break;
        }

        case MSG_M0TOM4_ZCL_CLUSTER_ALARM_CB:
        {
            ZbApsdeDataIndT *dataIndPtr;
            void *cb_arg;
            int err;

            assert(p_notification->Size == 2);
            dataIndPtr = (ZbApsdeDataIndT *)p_notification->Data[0];
            cb_arg = (void *)p_notification->Data[1];
            err = zcl_cluster_alarm_data_ind(dataIndPtr, cb_arg);
            /* Return err in second argument */
            p_notification->Data[1] = (uint32_t)err;
            break;
        }

        case MSG_M0TOM4_ZCL_CLUSTER_CMD_REQ_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(struct ZbZclCommandRspT *rsp, void *cbarg);

                callback = (void (*)(struct ZbZclCommandRspT *rsp, void *cbarg))info->callback;
                callback((struct ZbZclCommandRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZCL_CLUSTER_CMD_RSP_CONF_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbApsdeDataConfT *conf, void *arg);

                callback = (void (*)(ZbApsdeDataConfT *conf, void *arg))info->callback;
                callback((ZbApsdeDataConfT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZCL_COMMAND_REQ_CB:
        {
            int err = ZB_APS_FILTER_CONTINUE;

            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                int (*callback)(struct ZbZclCommandRspT *conf, void *arg);

                callback = (int (*)(struct ZbZclCommandRspT *rsp, void *arg))info->callback;
                err = callback((struct ZbZclCommandRspT *)p_notification->Data[0], info->arg);
            }
            /* Return err in second argument */
            p_notification->Data[1] = (uint32_t)err;
            break;
        }

        case MSG_M0TOM4_ZCL_COMMAND_NO_RSP_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbApsdeDataConfT *conf, void *arg);

                callback = (void (*)(ZbApsdeDataConfT *conf, void *arg))info->callback;
                callback((ZbApsdeDataConfT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZCL_READ_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZclReadRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZclReadRspT *rsp, void *cbarg))info->callback;
                callback((ZbZclReadRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZCL_WRITE_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZclWriteRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZclWriteRspT *rsp, void *cbarg))info->callback;
                callback((ZbZclWriteRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZCL_DISCOVER_ATTR_CB:
            assert(p_notification->Size == 2);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[1];
            if (info->callback != NULL) {
                void (*callback)(ZbZclDiscoverAttrRspT *rsp, void *cbarg);

                callback = (void (*)(ZbZclDiscoverAttrRspT *rsp, void *cbarg))info->callback;
                callback((ZbZclDiscoverAttrRspT *)p_notification->Data[0], info->arg);
            }
            break;

        case MSG_M0TOM4_ZCL_KE_WITH_DEVICE_CB:
            assert(p_notification->Size == 5);
            info = (struct zb_ipc_m4_cb_info *)p_notification->Data[4];
            if (info->callback != NULL) {
                void (*callback)(uint64_t partnerAddr, uint16_t keSuite, enum ZbZclKeyStatusT key_status, void *arg);
                uint64_t partnerAddr;

                zb_ipc_m4_memcpy2(&partnerAddr, &p_notification->Data[0], 8);
                callback = (void (*)(uint64_t partnerAddr, uint16_t keSuite, enum ZbZclKeyStatusT key_status, void *arg))info->callback;
                callback(partnerAddr, (uint16_t)p_notification->Data[2], (enum ZbZclKeyStatusT)p_notification->Data[3], info->arg);
            }
            break;

        default:
            status = HAL_ERROR;
            break;
    }

    if (info != NULL) {
        zb_ipc_m4_cb_info_free(info);
    }

    TL_ZIGBEE_SendAckAfterAppliNotifFromM0();
    return status;
} /* Zigbee_CallBackProcessing */

HAL_StatusTypeDef
Zigbee_LoggingProcessing(void)
{
    const char *log_str;
    Zigbee_Cmd_Request_t *p_logging = ZIGBEE_Get_LoggingPayloadBuffer();

    assert(p_logging->Size == 1);
    log_str = (const char *)p_logging->Data[0];
    cli_port_print_msg(NULL, log_str);

    TL_ZIGBEE_SendAckAfterAppliLoggingFromM0();
    return HAL_OK;
} /* Zigbee_LoggingProcessing */
